using System;
namespace Timer
{
    public class JokesDataBase
    {
        #region Jokes
        private static string[] jokes = new string[]
        {
@"Кое е това нещо, което е невидимо във въздуха и ни прави щастливи?
- Любовта?
- Не, безплатния Wi-Fi.",

@"Защо няма снежен човек блондинка?
- Защото няма куха снежна топка.",

@"Блондинка влиза в шоурум и пита продавача:
- Здравейте, бих искала да купя (Рено).
- Модел?
- Не, продавачка. Но благодаря за комплимента!",

@"Какво си мисли блондинка, като види салата (Айсберг)?
- Как е възможно това да потопи (Титаник)...",

@"Две блондинки си говорят:
- Скъпа, изглеждаш ослепително!
- Защото съм отслабнала! Трябваше да ме видиш преди месец. Бях като теб сега...",

@"Две блондинки отишли в пустинята. Едната носила със себе си прозорец. Другата я попитала:
- Защо носиш прозорец?
- Защото, ако ни стани горещо, да го отворя.",

@"От задника на орел се показал един глист и попитал:
- Извинете, господин Орел, на каква височина летим?
- Мммм, на около 900 метра!
- Нали няма да акате, че екипажът се притеснява...",
   
@"Една учителка дала на учениците да напишат съчинение по тема: (Що е мърэел?). 
Писмените работи били написани. Учителката започнала да ги проверява. Попаднала на една тетрадка,
в коята на първия лист било написано само эаглавието. Отворила учителката на втория лист, гледа - няма нищо. 
Отворила на третия лист, на четвъртия - пак нищо, но когато отворила на петия, 
на страницата било написано с големи букви: (Ето това е мърэел)",

@"Кола се движи по магистралата, в нея - майка и син. В един момент от предната кола изхвърча
вибратор и се забива в стъклото. Майката и детето се споглеждат, то пита - Мамо, какво е това? -
Ми кво е... това е... това е... насекомо! - Е гати насекомото, как лети с тоя х*й?",

@"Върви си Червената шапчица из гората, а насреща й излиза вълкът.
- Червена шапчице, не те ли е страх да се разхождаш сама в гората?
- Защо да ме е страх? Познавам гората, обичам секса...",

@"Изпаднала в носталгия, Наташа Ростова романтично пита поручик Ржевски:
- Кажете, поручик, а Вие помните ли своята първа учителка?
- Доколкото помня, Наташа, първа беше една медсестра…",

@"- Ало! Това секс телефона ли е?
- О, да-а, писанчо! Бавно си разкопчавам блузката, смъквам полата и.....
- Обаждаме се от полицията.
- Да, да! Вече се облякох!",
                                                       
@"Мъж с обратна ориентация пита в аптеката:
- Извинете имате ли Трибестан?
- Да отговаря аптекарката ще вдигаш самолета ли?
- Не, днес ще се возя.",

@"- Защо Дядо Коледа е толкова щастлив?
- Защото знае адресите на всички лоши момичета.",
                                                       
@"Преди изборите си говорят двама:
- Като се събудя и ако ми е надясно ще гласувам за десницата, а ако ми е наляво - за левицата.
- А ако ти е напред?
- Дреме ми тогава за изборите!!!",

@"Буен семеен секс.
Тя:
- Ааах!... Оооох!... Говори ми мръсотии!... Уууух!... Аааах!... Кажи нещо мръсно, бе!...
Той:
- Кухнята!... Банята!... Хола!... ",
                                                       
@"При психолога:
- Напоследък никой не ме разбира.
- В смисъл?",

@"Един се оплаква на приятеля си:
- Интимния живот с жена ми стана една такава сива история...
- Ами разнообрази я малко. Защо, например, не поиграеш с нея на чичо доктор за около час? Аз лично така правя.
- Хубава идея. А на теб как ти се удава да играеш с жена ти цял час на доктор?
- Много лесно: 55 минути стои в коридора и си чака реда.",
                                                       
@"Срещат се две планети. Една казва:
- Как е?
- Зле, - отговаря другата, - завъдиха ми се хора. Непрекъснато нещо правят, взривяват, ровят. Не се търпи!
- Потърпи малко. И аз имах. Ще ти мине...",

@"- Петърчо, какъв искаш да станеш като порастнеш?
- Полицай.
- А ти, Сашко?
- Бандит, за да можем пак да си играем заедно",
                                                       
@" Между приятелки:
- Бих се омъжила само по любов.
- Аз също, ако не изскочи нещо по-добро.",

@"Трите най-редовни студентски лъжи:
- От утре почвам да уча!
- Съблечи се, нищо няма да ти направя.
- Дай 20 кинта, утре ти ги връщам.",
                                                       
@"- Митко, подай си шепичката, за да ти сипя орехи!
- Татко ще ги вземе.
- Ти не обичаш ли орехи?
- Обичам, но ръката но татко е по-голяма!",

@"Доктор преглежда пациент в безсъзнание и казва на жена му:
- Съжалявам, но нищо не мога да направя - вижте как са му посинели ръцете, вече умира...
- Докторе, той е бояджия, затова са му сини ръцете.
- Значи има късмет, ако не беше бояджия - досега да е умрял.",

        };
        #endregion Jokes
        public static void GetRandomJoke()
        {
            Random rnd = new Random();
            int random = rnd.Next(0, jokes.Length);
            for (int i = 0; i < 50; i++)
            {
                random = (GenerateDigit(rnd));
            }
            Console.WriteLine(jokes[random]);
        }
        static int GenerateDigit(Random rnd)
        {
            // Assume there'd be more logic here really
            return rnd.Next(0, jokes.Length);
        }
    }
}